
## 隱私協議

歡迎使用密碼記錄軟件（以下簡稱「本軟件」或「我們」），本軟件是一款專業的密碼記錄軟件，可以幫助你輕松管理和保護你的各種密碼。在使用本軟件之前，請你仔細閱讀並同意本隱私協議，了解我們如何處理你的數據和權利。

本隱私協議適用於本軟件提供的所有服務，無論你是通過移動設備、電腦或其他方式使用本軟件。

如果你不同意本隱私協議的任何內容，你應該立即停止使用本軟件。如果你繼續使用本軟件，即表示你已充分理解並同意本隱私協議。

我們收集的數據

我們非常重視你的隱私和安全，因此我們不會收集或存儲你的任何個人信息，包括但不限於你的姓名、電話號碼、電子郵件地址、實際地址等。

我們也不會收集或存儲你在本軟件中創建和保存的任何密碼數據，包括但不限於你的社交賬號、購物網站、遊戲平臺、銀行卡、郵箱、Wi-Fi等的密碼，以及你為每個密碼添加的圖片等。

我們如何處理數據

我們不會收集或存儲你的任何數據，因此我們也不會使用、共享、轉讓、披露或出售你的任何數據。

我們采用本地存儲的方式來保護你的數據，即你的所有數據只保存在你自己的設備上，不會上傳到任何服務器或雲端。這意味著只有你自己可以訪問和管理你的數據，我們或任何第三方都無法獲取或修改你的數據。

請註意，由於我們采用本地存儲的方式，如果你刪除了本軟件或更換了設備，你將無法恢復你的數據，因此請務必妥善備份和保管好你的數據。

我們如何保護數據

我們采用了多種技術和措施來保護你的數據的安全性和完整性，例如：

- 我們使用加密技術來加密和解密你的數據，防止未經授權的訪問或篡改。
- 我們支持手勢應用鎖、面容解鎖和指紋解鎖等方式來保護你的應用，防止他人打開或刪除你的本軟件。
- 我們定期檢查和更新我們的技術和措施，以適應最新的安全標準和法律要求。

盡管我們已經盡力保護你的數據，但請註意，由於互聯網的開放性和不確定性，沒有任何一種安全措施是絕對完美或不可突破的。因此，我們不能保證你的數據在傳輸過程中或存儲時不會遭到任何形式的損失、泄露、濫用、篡改或破壞。如果發生這樣的情況，我們將及時通知你，並采取合理措施來減輕風險和損失。

如果你發現或懷疑有任何人非法使用或泄露了你的數據，請立即聯系我們，我們將盡快進行調查和處理。

我們如何更新隱私協議

為了更好地保護你的隱私和安全，以及適應法律法規和技術發展的變化，我們可能會不時地修改和更新本隱私協議，並在本軟件中公布最新版本。如果修改或更新涉及到重大變更或影響到你的權利義務，請註意查看並同意最新版本。如果你繼續使用本軟件，則表示你已接受修改或更新後的隱私協議。

聯系我們

如果你對本隱私協議有任何疑問、意見或建議，請通過以下方式聯系我們：

電子郵件：wengyunqiang@gmail.com

感謝你選擇並信任本軟件！
